{ 
    "name": "Carmine D'Angelo",
    "ed": "Education",
    "progetti": "Projects",
    "contatti" : "Contacts",
    "data_sup": "September 2010 – July 2016",
    "titolo_sup": "High school diploma: Computer science and telecommunications",
    "igs": "Project: IGS (Imprese Giovani Studenti): project aimed at simulating the creation of a company, devising a business idea, raising a share capital, assuming corporate offices, developing the business plan, concretely creating real products or services. The project proposed was based on a car park with automated management using renewable sources. My role within the project was advertising and sponsorship. <br> Facebook page: <a href = https: //www.facebook.com /greentechspa>GREEN.TECH </a>. ",
    "data_tri": "September 2016 - January 2020",
    "titolo_tri": "Bachelor's degree in computer science ",
    "data_mag": "September 2020 - ongoing",
    "titolo_mag": "Master's degree in computer science: cyber security curriculum",
    "messaggio": "Message:",
    "mystego": "Android application developed for the data compression exam. Its task is to encrypt a message using the RSA algorithm and to conceal it inside an image using steganography.",
    "vediProg": "View Project",
    "smartCup": "Android application developed for the Enterprise Mobile Application Development exam. The application was developed with the help of some students of the master of economics and using flutter and dart as languages. The aim was to provide a digital cupboard to help the user with his shopping.",
    "planE":"Design activity carried out for the penetration testing exam, in which a machine is analyzed in search of its vulnerabilities and trying to gain control.",
    "about" : "Hi, I am Carmine D'Angelo, I am 25 years old and I am a university student of Computer Science in Fisciano, Salerno. From an early age I have always been fascinated by video games and how they were made. When in my adolescence I started to approach computer science I loved the possibility of being able to create any software that could help me.",
    "compilatori": "Creation of the Frontend part of a compiler (also called transpiler), written in Java following the specifications given during the Compilers course. The specifications in question are of the NewLang language, the task of our transpiler was to transform NewLang into the C language.",
    "sicurezza": "Data security review project. The project is based on an electronic voting system implemented through the use of a blockchain."
}