{ 
    "name": "Carmine D'Angelo",
    "ed": "Formazione scolastica",
    "progetti": "Progetti",
    "contatti" : "Contatti",
    "data_sup": "Settembre 2010 - Luglio 2016",
    "titolo_sup": "Diploma tecnico industriale: Informatica e telecomunicazioni",
    "igs": "Progetto: IGS (Imprese Giovani Studenti): progetto improntato a simulare la creazione di un'impresa,     ideando una business idea, raccogliendo un capitale sociale, assumendo le cariche sociali, elaborando il business plan, realizzando concretamente prodotti o servizi reali. Il progetto proposto si basava su di un parcheggio con gestione automatizzata utilizzando fonti rinnovabili.Il mio ruolo all'interno del progetto è stato di publicitario e raccolta di sponsor.<br>    Pagina facebook: <a href=https://www.facebook.com/greentechspa>GREEN.TECH</a>.",
    "data_tri": "Settembre 2016 - Gennaio 2020",
    "titolo_tri": "Laurea triennale in informatica",
    "data_mag": "Settembre 2020 - in corso",
    "titolo_mag":"Laurea magistrale in informatica: curriculum sicurezza informatica",
    "messaggio": "Messaggio:",
    "mystego": "Applicazione sviluppata in android per l'esame di compressione dati. Il suo compito è di cifrare un messaggio utilizzando l'algoritmo RSA e di occuttarlo all'interno di un'immagine utilizzando la steganografia. ",
    "vediProg": "progetto",
    "smartCup":"Applicazione in android sviluppata per l'esame di Enterprise Mobile Application Development. L'applicazione è stata sviluppata con l'aiuto di alcuni ragazzi della magistrale di economia e utilizzando flutter e dart come linguaggi. Lo scopo è stato quello di fornire una dispensa digitale per aiutare l'utente con la sua spesa.",
    "planE":"Attività progettuale svolta per l'esame di penetration testing, in cui si analizza una macchina alla ricerca delle sue vulnerabilità e cercando di ottenerne il controllo.",
    "about": "Ciao, sono Carmine D'Angelo, ho 25 anni e sono uno studente universitario di Informatica a Fisciano, Salerno. Fin da piccolo sono sempre rimasto affascinato dai videogiochi e di come essi siano realizzati. Quando nella mia adolescenza ho iniziato ad approcciarmi con l'informatica  ho amato molto la possibilità di poter creare da solo un qualsiasi software che poteva aiutarmi.",
    "compilatori": "Creazione della parte Frontend di un compilatore (anche detto transpiler), scritto in Java seguendo le specifiche date durante il corso di Compilatori. Le specifiche in questione sono del linguaggio NewLang, il compito del nostro transpiler è stato quello di trasformare NewLang nel linguaggio C.",
    "sicurezza": "Progetto per l'esame sicurezza dei dati. Il progetto si basa su un sistema di votazione elettronica implementato tramite l'utilizzo di una blockchain."
}
